Лабораторная 1.1

1. Скачать и развернуть gcc (https://github.com/skeeto/w64devkit/releases)
2. Скачать и установить Dev-C++ (ver 5) (https://www.bloodshed.net/)
3. Подключить gcc к Dev-C++ и установить дополнительный параметр
компилятора -std=c23
4. Создать консольное приложение на языке С, написав внутри функции
main команду printf("Hello world!\n");

Лабораторная 1.2

1. Указать в перемнной окружения  PATH путь к папке bin gcc
C:\w64devkit\bin
2. Проверить доступность gcc в командной строке: gcc --version
3. Установить VSCode https://code.visualstudio.com/
4. Устновить C/C++ Extension Pack
5. Открыть папку с проектом в VSCode
6. Скомпилировать и запустить main.c создав задачу C++ (GDB)
(файл .vscode/tasks.json)
7. Добавтиь параметр "-std=c23", в аргументы задачи (args)

Лабораторная 2.1

1. Ввести температуру в градусах цельсия (вещественное число - %lf)
2. Перевести температуру в градусы фаренгейта по формуле tc * 9 / 5 + 32
3. Вывести температуру в градусах фаренгейта (%lf)
4. Вывести температуру в градусах фаренгейта с 3 знаками после запятой

Лабораторная 3.1
1. В функцию main() добавить три целочисленных переменных
2. Ввести значения этих переменных с клавиатуры
3. Найти максимальное значение и распечатать его

Лабораторная 4.1
1. Пользователь вводит своё имя
2. Ввести сообщение: Hello, Name! (если введенное имя не пустое)
или Hello, Stranger! (если введенное имя пустое)
Использовать: gets(char*)
#include <string.h>
strlen(char*)
3. Реализовать эту же задачу используя 1 if без else

Лабораторная работа 4.2
1. Пользователь вводит число ворон на ветке (целое от 0 до 9)
2. Программа выводит сообщение: На ветке 5 ворон
Надо вывести слово ворона в правильном падеже (определить с помощью switch)
3. Дополнить программу, чтобы она корректно определяла падеж слова "ворона" для любого числа.

Лабораторная работа 4.3
1. Написать программу решения квадратного уравнения
	ax^2 + bx + c = 0
	a!=0
	
	D = b*b-4*a*c;
	
	D < 0 no roots
	D == 0.0 x = -b/(2*a)
	D > 0 x1 = (-b+sqrt(D))/(2*a) x2 = (-b-sqrt(D))/(2*a)

	#include <math.h>

Лабораторная работа 4.4
1. Найти Наибольший Общий делитель двух целых (GCD) - алгоритм Евклида
	k1 >= k2
	k1 % k2 = k3 (если k3 == 0, то ответ k2)
	k2 % k3 = k4 (если k4 == 0, то ответ k3)

	НОД(1071, 462) == 21

Лабораторная работа 4.5
1. Распечатать таблицу ASCII 16x16

	0 1 2 3   ... F
0
1
2	   символ с кодом 32   
.
.
F

Лабораторная 5.1

1. Определить константу PI через макрос
2. Опрелить макрофункцию для нахождения длины окружности по радиусу
3. Определить макрофункцию для нахождения площадь круга по радиусу
4. Перенести созданные макросы в отдельный заголовочный файл, оформив его правильно








